Revit 2027 API
Toposolid.CreateSubDivision Method
Overload List
Name | Description
CreateSubDivision(Document, IList<CurveLoop>) |  Creates a Toposolid subdivision element with the current Toposolid as its host, using the default Toposolid type as the type of the new subdivision.
CreateSubDivision(Document, ElementId, IList<CurveLoop>) |  Creates a Toposolid subdivision element with the current Toposolid as its host.
Top
See Also
Reference
Toposolid Class
Autodesk.Revit.DB Namespace